* resolve Conversions and Fragments
  > check same 'family' or 'dimension' or 'property'
* parseXXX() all start with createXXX();, even though the created node may not be needed.
* use |x| for absolute value. (and also floor and ceil symbols? No - too difficult to type)
* don't execute() function when args have errors. 
  > remove error merging in max()
* improve units
  > can be complex (sort of expresson with only mult, div and power)

* save last statement in localStorage.
* add line and pos to errors.
* implicit mult with power: precedence changes depending on order?
  > 2^3b  =  2^(3b) >> mult has prio
  > 2b^3  =  2(b^3) >> power has prio
* Tokenizer: replace all strlen(stream) with a variable.
* www: keypad.

Nice to have
---------------
* implicit unit conversion:
  > a=3km-5m.km; --> a=2.995km
  > a=3km-5m;  --> same value, but...what unit? Leftmost? Lowest resolution? SI unit?
  > a=3000m-1km; --> 2000m?
* unary operators ++, --
* units : nest them with operators
  > m, km, cm, mm,...
  > conversion?
    x = 10m; //what if m is defined as var (m=mass)? Warning would be annoying...but will only display for implicit mult! So...warning is ok?
    y = (cm)x; //is casting! Programmers may prefer this.
    y = x.cm;
    y = y.cm;
    y = (10km).cm;
    y = 10km.m; // conversion from km to m.
    z = 10in.cm;
    or use : ?
    x = 10km:m;
    y  = x:in;
    z=y:cm;
  > unit definitions are grouped per property (length, weight,...)
  > how to clear units?
    a=x.;
    a=(x.)+3;
    a=x.+3;
    a=x.value;
    a=value(x);
    a=area(sdfsdfs).;
    a=a.;
  > mathlab not compact enough:
    https://nl.mathworks.com/help/symbolic/units-of-measurement-tutorial.html
* magnitudes:
  > within one unitClass
    x = 3km - 5m; --> x = 2.nnn km?
* dates:
  > Value is currently only numeric.
    > how to solve?
    > any value can suddenly be turned into a date fragment:
      (a*5+2)hours;
    > so, fragments are ordinary Values with a unit.
    > how about dates?
    > You can't add dates:
      yesterday + today = nonsense;
    > but dates can still be used in expressions:
      lastMonday = today-3days; --> <date> = <date> op <value>
  > only once units and conversions/fragments are implemented.
  > x = '12/12/2022 23:45:11';
  > time-span: date - date -> timespan
  > now() function
  > fragments:
    > x = now().year
    > .year, .month,... 
      > are all integers, as decimals are confusing? 
      > warning when stripping a decimal part? Suggesting conversion to a lower type?
      > complex calculation:
        > (1hour/2)*4 = 2hours !! thus, no warning needed!
        > only warn about rounding at the end result
          > when assinging to  var
          > when converting to other unit.
  > half a minute?
    > 1min.sec/2 => 30sec 
    > imin/2 => omin !!!
  > data types:
    > see chrono lib
    - timepoint (don't use 'date' as this will be a unit for timepoint truncated to only the date part)
      > representation? readable date with or without time?
      > depends on unit:
        - date: only date
        - dt (or datetime?): plus time
        - time: 
          > does this make sense?
          > a time is perhaps only a duration?
          > when a 
    - duration:
      > units
        > singular and plural can be used - same meaning.
        - day, month, year, hour, minute, second
        - short version: dd, mm, yy, hh, min, ss
  > units (fragments):
    >
  > conversions:
    - UTC
    - GPS
    -...
* Implicit variable:
    Implicit var _ always contains the last result (being the result of the previous statement)
    10+20+30;
    +40: //add to the result of the previous line.
    But what if:
    A=10;
    +20;//add this to A or only to implicit var or error? -> no error. Add to Implicit result.
    B=50;
    +=30; //add to var of previous line.
    +=40;// continue adding…

    C=_; //underscore is implicit var. Assign last value to C, which is B in this case;
    70;
    D=_;//D = 70

* custom functions
* resolve equations

* simplify
* Latex visualisation